# FailedToSetLeaderGroupId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..FailedToSetLeaderGroupId Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to set id of group type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedToSetLeaderGroupId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedToSetLeaderGroupId As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedToSetLeaderGroupId {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace